Autodesk.Revit.DB.IForgeSchemaServer.GetAccountDetails(Autodesk.Revit.DB.ForgeTypeId)
Returns details about the account that owns the given parameter schema identifier.

Autodesk.Revit.DB.IForgeSchemaServer.GetBindings(Autodesk.Revit.DB.ForgeTypeId)
Returns the category bindings, group bindings, and visibility assigned to the given parameter schema.

Autodesk.Revit.DB.IForgeSchemaServer.GetSchema(Autodesk.Revit.DB.ForgeTypeId)
Returns the requested schema as a JSON string.

Autodesk.Revit.DB.IForgeSchemaServer
The external server interface for interacting with the Forge Schema Service.